       IDENTIFICATION DIVISION.
       PROGRAM-ID. Exe36.
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

           77 ZNUM PIC ZZ9 VALUE IS ZERO.
           77 ASTNUM PIC **9 VALUE IS ZERO.
           77 DOLNUM PIC $99 VALUE IS ZERO.
           77 MINNUM PIC -99 VALUE IS ZERO.
           77 PLUSNUM PIC +99 VALUE IS ZERO.
           77 COMMANUM PIC 9,9 VALUE IS ZERO.
           77 BLANKNUM PIC 9B9 VALUE IS ZERO.
           77 ZRNUM PIC 990 VALUE IS ZERO.
           77 SLASHNUM PIC 9/9 VALUE IS ZERO.
           77 BWZNUM PIC Z99 BLANK WHEN ZERO.

       PROCEDURE DIVISION.
           PERFORM PROCESS-PARA.
       MAIN-PROCEDURE.
            STOP RUN.

           PROCESS-PARA.
               MOVE 33 TO ZNUM.
                   DISPLAY 'ZERO SUPPRESED ' ZNUM.
               MOVE 33 TO ASTNUM.
                   DISPLAY 'ASTRISK IN PLACE OF ZERO ' ASTNUM.
               MOVE 33 TO DOLNUM.
                   DISPLAY 'DOLLAR PRECEDING THE NUMERIC ' DOLNUM.
               MOVE -33 TO MINNUM.
                   DISPLAY 'MINUS SIGN PRECEDING THE NUMERIC 'MINNUM.
               MOVE 33 TO MINNUM.
                   DISPLAY 'MINUS SIGN PRECEDING THE NUMERIC 'MINNUM.
               MOVE +33 TO PLUSNUM.
                   DISPLAY 'PLUS SIGN PRECEDING THE NUMERIC 'PLUSNUM.
               MOVE -33 TO PLUSNUM.
                   DISPLAY 'PLUS SIGN PRECEDING THE NUMERIC 'PLUSNUM.
               MOVE 33 TO COMMANUM.
                   DISPLAY 'COMMA SIGN IN THE NUMERIC 'COMMANUM.
               MOVE 33 TO BLANKNUM.
                   DISPLAY 'BLANK IS INSERTED IN THE NUMERIC 'BLANKNUM.
               MOVE 33 TO ZRNUM.
                   DISPLAY 'ZERO IS INSERTED IN THE NUMERIC 'ZRNUM.
               MOVE 33 TO SLASHNUM.
                   DISPLAY 'SLASH IS INSERTED IN THE NUMERIC 'SLASHNUM.
               MOVE 033 TO BWZNUM.
                  DISPLAY 'BLANK INSERTED WHEN ZERO THE NUMERIC 'BWZNUM.

       END PROGRAM Exe36.
