       IDENTIFICATION DIVISION.
       PROGRAM-ID. Exe42.
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

           01 PERSONRECORD.
                 02 PERSONID PIC 9(05) VALUE IS 1234.
                 02 PERSONNAME PIC X(05) VALUE IS 'PABOO'.

           01 PERSONREPORT.
                 02 PERSONID PIC 9(05) VALUE IS ZEROS.
                 02 FILLER PIC X(03) VALUE IS '***'.
                 02 PERSONNAME PIC X(05) VALUE IS SPACES.
                 02 FILLER PIC X(03) VALUE IS '***'.

       PROCEDURE DIVISION.

           PERFORM DISPLAY-PARA.

       MAIN-PROCEDURE.

           MOVE CORR PERSONRECORD TO PERSONREPORT
           DISPLAY "---AFTER CORRESPONDING---"
           DISPLAY "PERSON RECORD " PERSONRECORD
           DISPLAY "PERSON REPORT " PERSONREPORT

            STOP RUN.

           DISPLAY-PARA.
           DISPLAY "---BEFORE CORRESPONDING---"
           DISPLAY "PERSON RECORD " PERSONRECORD
           DISPLAY "PERSON REPORT " PERSONREPORT.

       END PROGRAM Exe42.
